/**
 * 字符串正则规则集及校验函数
 */
export const RegexRules = {
  intOrFloat: /^-?\d+(?:\.\d{1,2})?$/,
  /** 仅正整数或最多两位小数的正浮点数 */
  positiveIntOrFloat: /^\d+(?:\.\d{1,2})?$/,
  /** 仅负整数或最多两位小数的负浮点数 */
  negativeIntOrFloat: /^-\d+(?:\.\d{1,2})?$/,
  number: /^[0-9]*$/,
  startingWithNonZero: /^([1-9][0-9]*)$/,
  nonZeroPositiveInt: /^\+?[1-9][0-9]*$/,
  nonZeroNegativeInt: /^\-[1-9][0-9]*$/,
  enCharacter: /^[A-Za-z]+$/,
  upperEnCharacter: /^[A-Z]+$/,
  lowerEnCharacter: /^[a-z]+$/,
  enCharDotUnderline: /^[a-zA-Z0-9._]+$/,
  numberEnCharacter: /^[A-Za-z0-9]+$/,
  numberEnUnderscore: /^\w+$/,
  containSpecialChar: /[!@#\$%\^&\*\(\)_\+\[\]{}|;':",./<>?]/,
  email: /^\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*$/,
  chinesePhoneNumber: /^(?:\+86)?1[3-9]\d{9}$/,
  chineseIDCardNumber: /^(\d{15}|\d{17}[\dXx])$/,
  containChineseChar: /\p{Script=Han}/u,
  doubleByte: /[^\x00-\xff]/,
  emptyLine: /^\s*$/,
  ipv4: /^((25[0-5]|2[0-4]\d|[01]?\d\d?)\.){3}(25[0-5]|2[0-4]\d|[01]?\d\d?)$/,
  hex: /^[0-9a-fA-F]+$/,
  dateTime: /^\d{4}[-/.]\d{1,2}[-/.]\d{1,2}(?:[ T]\d{1,2}:\d{1,2}:\d{1,2}(?:\.\d{1,9})?)?(?:Z|[\+\-]\d{2}:\d{2})?$/,
  chinese: /^[\u4E00-\u9FA5]+$/,
  idCard15: /^[1-9]\d{7}(?:0\d|10|11|12)(?:0[1-9]|[1-2]\d|30|31)\d{3}$/,
  idCard18: /^[1-9]\d{5}(?:18|19|20)\d{2}(?:0[1-9]|10|11|12)(?:0[1-9]|[1-2]\d|30|31)\d{3}[\dXx]$/,
  idCard:
    /^\d{6}((((((19|20)\d{2})(0[13-9]|1[012])(0[1-9]|[12]\d|30))|(((19|20)\d{2})(0[13578]|1[02])31)|((19|20)\d{2})02(0[1-9]|1\d|2[0-8])|((((19|20)([13579][26]|[2468][048]|0[48]))|(2000))0229))\d{3})|((((\d{2})(0[13-9]|1[012])(0[1-9]|[12]\d|30))|((\d{2})(0[13578]|1[02])31)|((\d{2})02(0[1-9]|1\d|2[0-8]))|(([13579][26]|[2468][048]|0[048])0229))\d{2}))(\d|X|x)$/,
  postCode: /^[1-9][0-9]{5}$/,
  ipv6Full: /^([\da-f]{1,4}:){7}[\da-f]{1,4}$/i,
  ipv6Compressed:
    /^([0-9a-fA-F]{1,4}(:[0-9a-fA-F]{1,4})*)?::([0-9a-fA-F]{1,4}(:[0-9a-fA-F]{1,4})*)?$|^([0-9a-fA-F]{1,4}:){7}[0-9a-fA-F]{1,4}$/,
  telNumber:
    /^(?:(?:\+|00)86)?1(?:(?:3[\d])|(?:4[5-79])|(?:5[0-35-9])|(?:6[5-7])|(?:7[0-8])|(?:8[\d])|(?:9[189]))\d{8}$/,
  url: /^(((ht|f)tps?):\/\/)?([^!@#$%^&*?.\s-]([^!@#$%^&*?.\s]{0,63}[^!@#$%^&*?.\s])?\.)+[a-z]{2,6}\/?/,
  hexColor: /^#([0-9a-fA-F]{6}|[0-9a-fA-F]{3})$/,
  emojiRange:
    /[\uD800-\uDBFF][\uDC00-\uDFFF]|[\u2100-\u27FF]|[\u2B05-\u2B07]|[\u2934-\u2935]|[\u3297-\u3299]|[\uA9\uAE\u303D\u3030\u2B55\u2B1C\u2B1B\u2B50]/,
};
